loadtests/artillery.yaml
config:
  target: "ws://localhost:4567/game"
  phases:
    - duration: 10
      arrivalRate: 50
  variables:
    x: [50, 100, 150, 200, 250, 300, 350, 400, 450, 500, 550, 600, 650, 700, 750,
        800, 850, 900, 950, 1000, 1050, 1100, 1150, 1200, 1250, 1300, 1350]
    y: [50, 100, 150, 200, 250, 300, 350, 400, 450, 500, 550, 600, 650, 700, 750]
  ws:
    # Ignore SSL certificate errors
    # - useful in *development* with self-signed certs
    rejectUnauthorized: false
scenarios:
  - engine: "ws"
    flow:
      - send: "{login: {username: \"{{ $randomString() }}\"}}"
      - send: "{tych: [{{ x }},{{ y }}]}"
      - think: 10
      - send: "{logout: {cause: \"Artillery logout.\"}}"